# a = int(input("Введите первое число"))
# b = int(input("Введите второе число"))
# try:
#     a = int(a)
#     b = int(b)
# except ValueError:
#     a = str(a)
#     b = str(b)
# finally:
#     print(a + b)

# i = 0
#
# while i < 5:
#     print(i)
#     i += 1

# a = int(input("Укажите количество символов"))
# i = 0
# while i <= a:
#     print("*")
#     i += 1

# a = input("Введите начало диапазона")
# b = input("Введите конец диапазона")
#
# while a <= b:
#     if a % 2:
#         print(a)
#         a += 1

# while True:
#     n = int(input("Введите положительное число"))
#     if n < 0:
#         break
# res = 1
# while True:
#     a = int(input("Введите число"))
#     if a == 0:
#         break
#     res = a * res
# print(res)
